Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: will cause the source distribution and the Windows installer to be uploaded to PyPI. Note that these will be uploaded even if they are built using an earlier invocation of :file:`setup.py`, but that only distributions named on the command line for the invocation including the :command:`upload` command are uploaded.
pl: spowoduje że dystrybucja źródła i instalator Windows będą przesłane do PyPI. Zauważ że te będą przesłane nawet jeśli zostały zbudowane używając wcześniejszego odwołania do :file:`setup.py`, ale, że tylko dystrybucje nazwane w wierszu polecenia dla wywołania zawierającego polecenie :command:`upload` są wysyłane.

source: The :command:`upload` command uses the username, password, and repository URL from the :file:`$HOME/.pypirc` file (see section :ref:`pypirc` for more on this file). If a :command:`register` command was previously called in the same command, and if the password was entered in the prompt, :command:`upload` will reuse the entered password. This is useful if you do not want to store a clear text password in the :file:`$HOME/.pypirc` file.
pl: Polecenie :command:`upload` używa nazwy użytkownika, hasła, adresu repozytorium z pliku :file:`$HOME/.pypirc` (sięgni do rozdziału :ref:`pypirc` po więcej o tym pliku). Jeśli polecenie :command:`register` zostało poprzednio wezwane w tym samym poleceniem i jeśli hasło zostało wprowadzone na zapytanie, polecenie :command:`upload` użyje ponownie wprowadzonego hasła. To jest użyteczne jeśli nie chcesz przechowywać haseł otwartym tekstem w pliku :file:`$HOME/.pypirc`.

source: You can specify another PyPI server with the :option:`--repository=*url*` option::
pl: Możesz określić inny serwer PyPI opcją :option:`--repository=*url*`::

source: See section :ref:`pypirc` for more on defining several servers.
pl: Sięgnij do rozdziału :ref:`pypirc` po więcej o definiowaniu kilku serwerów.

source: You can use the :option:`--sign` option to tell :command:`upload` to sign each uploaded file using GPG (GNU Privacy Guard). The :program:`gpg` program must be available for execution on the system :envvar:`PATH`. You can also specify which key to use for signing using the :option:`--identity=*name*` option.
pl: Możesz użyć opcji :option:`--sign` aby przekazać poleceniu :command:`upload`, aby podpisywała każdy przesyłany plik używając GPG (GNU Strażnika Prywatności - z ang. Privacy Guard). Program :program:`gpg` musi być dostępny do uruchomienia w systemowej ścieżce przeszukiwania :envvar:`PATH`. Możesz też określić które klucze użyć dla podpisania używając opcji :option:`--identity=*name*`

source: Other :command:`upload` options include :option:`--repository=<url>` or :option:`--repository=<section>` where *url* is the url of the server and *section* the name of the section in :file:`$HOME/.pypirc`, and :option:`--show-response` (which displays the full response text from the PyPI server for help in debugging upload problems).
pl: Inne opcje polecenia :command:`upload` zawierają :option:`--repository=<url>` lub :option:`--repository=<section>` gdzie *url* jest adresem serwera i *sekcja* nazwą sekcji w :file:`$HOME/.pypirc`, i opcja :option:`--show-response` (która pokazuje pełen tekst odpowiedzi z serwera PyPI za pomoc w odpluskwianiu przy problemach z wysyłaniem na serwer).

source: PyPI package display
pl: pokaz pakietów PyPI

source: The ``long_description`` field plays a special role at PyPI. It is used by the server to display a home page for the registered package.
pl: pole ``long_description`` odgrywa specjalną rolę w PyPI. Jest używane przez serwer aby pokazać stronę domową zarejestrowanego pakietu.

source: If you use the `reStructuredText <http://docutils.sourceforge.net/rst.html>`_ syntax for this field, PyPI will parse it and display an HTML output for the package home page.
pl: Jeśli używasz składni reStructuredText-u <http://docutils.sourceforge.net/rst.html>`_ dla tego pola, PyPI przeczyta je i wyświetli wyjście HTML dla strony domowej pakietu

source: The ``long_description`` field can be attached to a text file located in the package::
pl: Pole ``long_description`` może być doczepione do pliku tekstowego umieszczonego w pakiecie::

source: In that case, :file:`README.txt` is a regular reStructuredText text file located in the root of the package besides :file:`setup.py`.
pl: W tym przypadku plik :file:`README.txt` jest zwykłym plikiem tekstowym reStructuredText umieszczonym w nadrzędnej lokalizacji pakietu poza :file:`setup.py`

source: To prevent registering broken reStructuredText content, you can use the :program:`rst2html` program that is provided by the :mod:`docutils` package and check the ``long_description`` from the command line::
pl: Aby zapobiec rejestrowaniu popsutej treści reStructuredText, możesz użyć programu :program:`rst2html` który jest dostarczony przez pakiet :mod:`docutils` i sprawdzić ``long_description`` z wiersza poleceń::

source: :mod:`docutils` will display a warning if there's something wrong with your syntax.
pl: pakiet :mod:`docutils` wyświetli ostrzeżenie jeśli coś będzie nie tak ze składnią.
